---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.ActualPowerLoad
source: html/23507fe1-3666-ff66-85cd-8fbf720897dc.htm
---
# Autodesk.Revit.DB.Mechanical.Space.ActualPowerLoad Property

Get the Actual Power Load of the Space.

## Syntax (C#)
```csharp
public double ActualPowerLoad { get; }
```

## Remarks
This property is used to get the Actual Power Load of the Space.